<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <title>Agreement-Sinhala</title>
    <style>
        @font-face {
            font-family: 'sinhala';
            src: url('fonts/IskoolaPota.ttf') format('truetype');
            font-weight: normal;
            font-style: normal;
        }

        body {
            font-family: 'sinhala', sans-serif;
            border: 2px solid #4CAF50;
            border-radius: 10px;
            padding: 20px;
            margin: 0;
            position: relative;
            box-shadow: 0 4px 10px rgba(0, 0, 0, 0.1);
        }

        .header {
            text-align: center;
        }

        .header > h1 {
            font-family: 'sinhala', sans-serif;
            font-weight: normal;
            font-style: normal;
            margin: 20px 0;
            font-size: 24px;
            color: black;
            text-decoration: underline;
        }

        .container {
            padding: 20px;
            background-color: #fff;
            border-radius: 10px;
        }

        .container > p {
            margin: 10px 0;
            line-height: 1.6;
        }

        .signatures {
            margin-top: 20px;
        }

        .signatures p {
            margin-bottom: 5px;
        }

        .footer {
            font-size: 14px;
            color: #777;
            width: 80%;
            text-align: center;
            margin: 0 auto;
            position: fixed;
            bottom: 0;
            left: 0;
            right: 0;
        }

        p {
            margin: 10px 0;
            width: 100%;
            text-align: justify;
        }
    </style>
</head>

<body>
<div class="container">

    <div class="header">
        <img src="https://devcglp-admin.webmotech.com/assets/images/cgl/logo/main-logo.png" alt="Company Logo"
             style="max-width: 100px;">
        <h1>වගා ආයෝජන ගිවිසුම</h1>
    </div>

    <p>
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
        සීදුව, කොළඹ මීගමු පාර, අංක 428 දරන ස්ථානයෙහි සිය ලියාපදිංචි කාර්යාලය පවත්වාගෙන යනු ලබන වර්ෂ 2007 අංක 07 දරන
        සමාගම් පනතේ විධිවිධානවලට අනුකූලව නිසියාකාරව සංස්ථාපනය කරන ලද සමාගම් ලියාපදිංචි අංක PV 00272936 දරන සිලෝන්
        ග්‍රීන් ලයිෆ් ප්ලාන්ටේෂන් (ප්‍රයිවට්) ලිමිටඩ් (මෙහි මින්මතු සමහර තැනක විකුණුම්කාර සමාගම ලෙස හදුන්වනු ලබන, එසේම
        එකී විකුණුම්කාර සමාගම යන පදය යෙදී ඇති අවස්ථාවේ හා ස්ථානයේ හැටියට එකී සමාගමේ අනුප්‍රාප්තිකයන්, අනුයාතකයින්, සහ
        පැවරුම්ලත් පාර්ශව ආදීන් ද අදහස් විය යුතුය.) එක් පාර්ශවයකට ද,
    </p>

    <p>
        &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
        (Address) දරන ස්ථානයේ පදිංචි (Customer Name) (ජාතික
        හැඳුනුම්පත් අංක (ld Number) ) (මෙහි මිත්මතු සමහර තැනක 'ගැනුම්කරු' ලෙස හදුන්වනු ලබන සහ එකී 'ගැනුම්කරු' යන පදය
        යෙදී ඇති අවස්ථාවේ හා ස්ථානයේ හැටියට එකී (Customer Name) සහ ඇයගේ/ඔහුගේ උරුමඃකාර, පොල්මාකාර, අද්මිනිස්ත්‍රාසිකාර,
        බලකාර, ලැබුම්කරුවන් අදහස් විය යුතුය.) අනෙක් පාර්ශවයට ද බැඳී,එකී පක්‍ෂය විසින් .......... දින .......... දී වගා
        ආයෝජනය සම්බන්ධයෙන් ඇතිකර ගන්නා ලද ගිවිසුමයි.
    </p>

    <p>
        (1) මෙම ගිවිසුම, විකුණුම්කාර සමාගම විසින් පේර ආශ්‍රිත නිෂ්පාදනය සඳහා අවශ්‍ය පේර ගස් විකුණුම්කාර සමාගමට අයත්
        ඉඩම්වල ගැනුම්කරු වෙනුවෙන් වගා කරනු ලබන අතර, එකී පේර ගස් නඩත්තු කිරිමත්, ඵල නෙලා එම ඵල දේශීය සහ විදේශීය වෙළඳපොල
        වෙත අලෙවි කරමින් ගැනුම්කරුට හිමි ප්‍රතිලාභ ලබා දීම හා බැඳේ.
    </p>

    <p>
        (2) එසේම අපනයනයෙන් ඉහල ආදායමක් ලබාගත හැකි ලෙස ජේර නිෂ්පාදනය කිරිමටත්, විදේශීය වෙළඳපොල තුල පවතින ඉල්ලුමට සරිලන
        පරිදි ඉහල වාණිජ වටිනාකමෙන් යුක්ත පේර නිෂ්පාදනය කිරිමටත් විකුණුම්කාර සමාගම එකඟ වේ.
    </p>

    <p>
        (3) ඒ අනුව, පේර ගස් රෝපණය කිරීම, නඩත්තු කිරීම සහ වර්ධනය වු අස්වැන්න අලෙවි කිරිම/ අපනයනය කිරිම විකුණුම්කාර සමාගම
        විසින් සිදුකරනු ලබන අතර එය මෙම ගිවිසුමේ සඳහන් අපේක්ෂිත ආදායම ප්‍රකාරව විකුණුම්කාර සමාගම විසින් ගැනුම්කරුට
        ප්‍රතිලාභ ගෙවනු ලබයි.
    </p>

    <p>
        (4) විකුණුම්කාර සමාගම විසින් පේර අලෙවියෙන් / අපනයනයෙන් ලබාගන්නා උපරිම ආදායමෙන් ගෙවිය හැකි වැඩිම ප්‍රතිලාභ මුදල
        සෑම මසකම බැර කරන බවට එකග වේ.
    </p>

    <ul>
        <li>
            ප්‍රතිලාභ ලබා ගන්නා දිනය ගැනුම්කරුට විකුණුම්කාර සමාගමේ එකඟතාවය මත තිරණය කළ හැකි අතර,
            ගිවිසුම් කාලය දිර්ඝ කරන්නේ නම් එය ගිවිසුම අවසන් වීමට පෙර වසරේදී විකුණුම්කාර සමාගමට දැනුම් දිය යුතුය.
        </li>
    </ul>

    <p>
        (5) මෙම ගිවිසුම (Invested Date) වන දින සිට (Matured Date) දින දක්වා වලංගු විය යුතු අතර, මෙම ගිවිසුම යටතේ
        ගැනුම්කරු විසින් විකුණුම්කාර සමාගමට ගෙවූ මුලු මුදල (lnested Amount In Letter) (Invested Amount In Numbers)
        වේ.
    </p>

    <p>
        (6) (Agreement Number) (ඇමුණුම බලන්න) යන ගිවිසුම ප්‍රාකාරව සහ මෙම ගිවිසුමේ අනෙකුත් වගන්ති ප්‍රාකාරව (Inested
        Amount In Letter) (Invested Amount In Numbers ) ආයෝජන මුදල ගිවිසුම අවසන් වන දිනට ගැනුම්කරු වෙත ලබා දීමට
        විකුණුම්කාර සමාගම එකග වේ.
    </p>

    <p>
        (7) මෙම ගිවිසුමේ සඳහන් වගාවන් අඛණ්ඩව මාස 4 සිට 12 කට වැඩි කාලයක් ස්වාභාවික විපතක් සිදුවුවහොත් එකී කාල සීමාවට
        අදාලව මෙම ගිවිසුමේ කාල සීමාව දිර්ඝ වන බවට දෙපාර්ශවයම එකඟ වේ. කෙසේ වෙතත් එවැනි ස්වාභාවික විපත් සඳහා රක්‍ෂණ
        ආවරණයක් ලබා ගනිමින් හානිය අවම කර ගැනීමටත් එකී රක්ෂණ රෙගුලාසි වලට අනුව වන්දි ලබා ගනිමින් වගාව යථා තත්ත්වයට පත් කර
        ගැනීමටත් විකුණුම්කාර සමාගම කටයුතු කරනු ලබයි. එසේම එහිදි වැයවන අමතර නඩත්තු පිරිවැය විකුණුම්කාර සමාගම විසින්
        දැර්මට එකඟ වේ.
    </p>

    <p>
        (8) නඩත්තු කාල සීමාව තුල අවශ්‍ය අවස්ථාවලදී වගාවට අවශ්‍ය පොහොර යෙදීම, වල් නාශක යෙදීම, ගස් කප්පාදු කිරිම, ජල
        සම්පාදනය හා ආරක්ෂාව සැපයීම හා සියලු මුලික නඩත්තු කටයුතු ඉටු කිරිමට විකුණුම්කාර සමාගම එකඟ වේ.
    </p>

    <p>
        (9) මෙම ගිවිසුමේ වලංගු කාලය අවසන් වීමට ප්‍රථම, මෙම ගිවිසුම අවලංගු කොට ගැනුම්කරු විසින් විකුණුම්කාර සමාගමට ගෙවනු
        ලද මුදල් විකුණුම්කාර සමාගමෙන් ඉල්ලා සිටිමේ දී,
    </p>

    <ol>
        <li>
            ගිවිසුම් කාල සීමාව තුල දී ගිවිසුම ආරම්භ වී මාස 3ක් අවසන් වීමට පෙර ගැනුම්කරු විසින් ගෙවා ඇති මුදල විකුණුම්කාර
            සමාගමෙන් ඉල්ලා සිටිමට කිසිඳු හිමිකමක් ගැනුම්කරුට නොමැති බවත්,
        </li>
        <li>
            ගිවිසුම් කාල සීමාව තුල මාස 3ක් අවසන් වීමෙන් පසු අවස්ථාවක දී ගැනුම්කරු විසින් ගෙවා ඇති මුදල විකුණුම්කාර
            සමාගමෙන් ඉල්ලා සිටිමට හිමිකමක් ගැනුම්කරුට ඇති බවත්,
        </li>
    </ol>

    <p>
        එසේ වුවද, ඉහත (i) හෝ (ii) යටතේ වන ඕනෑම ඉල්ලීමක දී මෙම ගිවිසුමේ (05) වන වගන්තියේ සඳහන් කාල සීමාව අවසානයේ දී
        පමණක්, මාස 12ක වාරික වශයෙන් ගැනුම්කරු විසින් ගෙවන ලද මුදලින් 30% ක මුදලක් ගැනුම්කරුට නැවත ගෙවනු ලබන බවටත්,
        දෙපාර්ශවයම එකඟ වේ.
    </p>

    <p>
        (10) මෙම ගිවිසුම යටතේ ගැනුම්කරු විසින් ගෙවිමට නියමිත මුලු මුදලින් 50% ක් හෝ මුලු මුදල ගෙවා නිම කිරීමෙන් අනතුරුව
        පේර ගස් ගැනුම්කරු නමින් වෙන්කර තැබීමට විකුණුම්කාර සමාගම එකඟ වේ.
    </p>

    <p>
        (11) ඉහත කොන්දේසිය ප්‍රකාරව ගැනුම්කරු විසින් මුලු මුදල ගෙවා නිමකරන දින සිට අවුරුදු එක (01)ක කාල සීමාව සඳහා බෝග
        වගාව සිදුකර ඒවා නඩත්තු කිරීමට විකුණුම්කරු එකඟ වන වේ.
    </p>

    <p>
        (12) එසේ වුවද, ගැනුම්කරු විසින් ගෙවීමට ඇති සම්පුර්ණ මුදල ගෙවා නිමකරන දින සිට මාස එක (01)කට පසුව උපරිම/අවම
        ප්‍රතිලාභ ගෙවන ලබනු බවට විකුණුම්කාර සමාගම එකඟ වේ.
    </p>

    <p>
        (13) ඉහත (09) වන වගන්තිය ප්‍රකාරව එකී ඉඩම් කොටස තුල වගාකොට ඇති පේර ගස් ප්‍රමාණය අතහැර ඉතිරි සියලු ගස්/වැල් හා
        ඒවායේ ඵලදාව විකුණුම්කාර සමාගමට හිමි බවත් ගැනුම්කරු පිළිගනී.
    </p>

    <p>
        (14) පුර්ව ලිඛිත දැනුම්දීමකින් පසුව ගැනුම්කරුට සහ හෝ ඔහුගේ නියෝජිතයකුට විකුණුම්කාර සමාගමේ නියෝජිතයෙකුගේ සහයෝගය
        යටතේ ඉඩම සහ වගා බිම පරීක්ෂා කිරීමේ හැකියාව ඇති අතර, එකී පුර්ව ලිඛිත ඉල්ලීම වැඩකරන දින 07කට පෙර සිදු කළ
        යුතුය.
    </p>

    <p>
        (15) ගැනුම්කරු මිය යාමකදී / පුර්ණ ආබාධිත තත්ත්වයකට පත්වන අවස්ථාවක දී ඔහු විසින් ඒ වන තෙක් ගෙවා ඇති මුදලට සාපේක්ෂ
        ඔහු විසින් නම්කරන ලද නාමිකයා වෙත ඉදිරියට ගෙවිය යුතු උපරිම/අවම ප්‍රතිලාභ ගෙවීමට විකුණුම්කාර සමාගම එකඟ වේ.
    </p>

    <p>
        (16) මෙම ගිවිසුම හා අදාල සියලුම දැන්වීම් විකුණුම්කාර සමාගමේ ඉහත ලිපිනයට තෑපැලෙන් සහ/හෝ පැමිණ භාර දිය හැකි අතර,
        විකුණුම්කාර සමාගමේ ලිපිනය වෙනස්වන අවස්ථාවකදී ඒ බව දිනපතා පලවන පුවත්පත්වල සිංහල, දෙමළ සහ ඉංග්‍රීසි භාෂාවෙන්
        සිදුකරනු ලබන දැනුම් දීම ගැනුම්කරු වෙත නිසිපරිදි සිදුකරනු ලබන දැනුම්දීමක් බවට ගැනුම්කරු පිළගනී. ගැනුම්කරු වෙත
        කරනු ලබන දැන්වීම් ඉහත සඳහන් ඔහුගේ ලිපිනයට සිදුකිරිමටත්, ලිපිනය වෙනස් වීමක දී විකුණුම්කාර සමාගමට ඒ බව දැන්වීමටත්
        ගැනුම්කරු එකඟ වේ.
    </p>

    <p>
        (17) මෙම ගිවිසුම සම්බන්ධයෙන් යම් මත භේදයක් පැන නගී නම් එය මධ්‍යස්ථ සමථකරුවෙකු ලවා බේරුම් කිරිමට දෙපාර්ශවයම එකඟ
        වේ.
    </p>


    <section class="signatures">
        <p>විකුණුම්කාර සමාගමේ අධ්‍යක්ෂක: _____________________</p>
        <p>ගැනුම්කරු: _____________________</p>
        <p>සාක්ෂි:</p>
        <p>1. _____________________</p>
        <p>2. _____________________</p>
    </section>

    <div class="footer">
        <p>@ 2024 සිලෝන් ග්‍රීන් ලයිෆ් වගා කටයුතු. සියලුම හිමිකම් ඇවිරිණි.</p>
    </div>
</div>

</body>
</html>
